## Title of our regression project

MLMaverick Team
- Seulah Lee 300361747
- David Steven Salazar Villegas 300356922
- Ishwinder Singh 300351938

## Importing Libraries (Collection of functions)
- **numpy** :  to perform a wide variety of mathematical operations on arrays
- **pandas** : to perform data manipulation that involves cleaning, transforming, and organizing data so that datset can be effectively analyzed
- **matplotlib.pyplot** : to view or present data in a pictorial or graphical format. Each pyplot function makes some change to a figure: e.g., creates a figure, creates a plotting area in a figure, etc.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## Importing unclean data csv

In [2]:
df = pd.read_csv('unclean_data.csv')

## Checking shape of dataframe

In [3]:
print("This dataset has {} data points with {} variables.".format(*df.shape))

This dataset has 4006 data points with 11 variables.

## Dropping all null value column and resetting indexes

In [4]:
df_cleaned = df.dropna(how='all').reset_index(drop=True)

In [5]:
print("This dataset has {} data points with {} variables.".format(*df_cleaned.shape))

This dataset has 3907 data points with 11 variables.

In [6]:
df_cleaned.head()

,model,year,price,transmission,mileage,fuel type,engine size,mileage2,fuel type2,engine size2,reference
0,C Class,2020.0,"£30,495",Automatic,NaN,Diesel,2,"1,200",NaN,NaN,/ad/25017331
1,C Class,2020.0,"£29,989",Automatic,NaN,Petrol,1.5,"1,000",NaN,NaN,/ad/25043746
2,C Class,2020.0,"£37,899",Automatic,NaN,Diesel,2,500,NaN,NaN,/ad/25142894
3,C Class,2019.0,"£30,399",Automatic,NaN,Diesel,2,"5,000",NaN,NaN,/ad/24942816
4,C Class,2019.0,"£29,899",Automatic,NaN,Diesel,2,"4,500",NaN,NaN,/ad/24913660

## Using str function to replace and bring values to proper format
- Clean_Price function which replaces pound sign from price column values
- Clean_Space function removes the comma from the values to make it easier to convert to numeric value

In [7]:

def clean_price(price_str):
    # Replace currency symbols and commas with empty space
    cleaned_price = price_str.replace('£', ' ')
    return cleaned_price

def clean_space(price_str):
    cleaned_price = price_str.replace(',','')
    return cleaned_price


df_cleaned['price'] = df_cleaned['price'].apply(lambda x: clean_price(x))
df_cleaned['price'] = df_cleaned['price'].apply(lambda x: clean_space(x))

In [8]:
df_cleaned.head()

,model,year,price,transmission,mileage,fuel type,engine size,mileage2,fuel type2,engine size2,reference
0,C Class,2020.0,30495,Automatic,NaN,Diesel,2,"1,200",NaN,NaN,/ad/25017331
1,C Class,2020.0,29989,Automatic,NaN,Petrol,1.5,"1,000",NaN,NaN,/ad/25043746
2,C Class,2020.0,37899,Automatic,NaN,Diesel,2,500,NaN,NaN,/ad/25142894
3,C Class,2019.0,30399,Automatic,NaN,Diesel,2,"5,000",NaN,NaN,/ad/24942816
4,C Class,2019.0,29899,Automatic,NaN,Diesel,2,"4,500",NaN,NaN,/ad/24913660

## Cleaning name of columns and making them in proper format using inplace so to change it in the original dataframe and not copy

In [9]:
df_cleaned.rename(columns={'fuel type':'fuel_type', 'fuel type2':'fuel_type2',
                           'engine size':'engine_size','engine size2':'engine_size2'}, inplace=True)

In [10]:
df_cleaned.head()

,model,year,price,transmission,mileage,fuel_type,engine_size,mileage2,fuel_type2,engine_size2,reference
0,C Class,2020.0,30495,Automatic,NaN,Diesel,2,"1,200",NaN,NaN,/ad/25017331
1,C Class,2020.0,29989,Automatic,NaN,Petrol,1.5,"1,000",NaN,NaN,/ad/25043746
2,C Class,2020.0,37899,Automatic,NaN,Diesel,2,500,NaN,NaN,/ad/25142894
3,C Class,2019.0,30399,Automatic,NaN,Diesel,2,"5,000",NaN,NaN,/ad/24942816
4,C Class,2019.0,29899,Automatic,NaN,Diesel,2,"4,500",NaN,NaN,/ad/24913660

## Merging values
- merging values of fuel_type2 into fuel_type and then removing the column fuel_type
- after this function we changes the fuel_type2 name to fuel_type.

In [11]:
df_cleaned['fuel_type2'] = df_cleaned['fuel_type2'].fillna(df_cleaned['fuel_type'])

In [12]:
df_cleaned.head()

,model,year,price,transmission,mileage,fuel_type,engine_size,mileage2,fuel_type2,engine_size2,reference
0,C Class,2020.0,30495,Automatic,NaN,Diesel,2,"1,200",Diesel,NaN,/ad/25017331
1,C Class,2020.0,29989,Automatic,NaN,Petrol,1.5,"1,000",Petrol,NaN,/ad/25043746
2,C Class,2020.0,37899,Automatic,NaN,Diesel,2,500,Diesel,NaN,/ad/25142894
3,C Class,2019.0,30399,Automatic,NaN,Diesel,2,"5,000",Diesel,NaN,/ad/24942816
4,C Class,2019.0,29899,Automatic,NaN,Diesel,2,"4,500",Diesel,NaN,/ad/24913660

In [13]:
df_cleaned.drop(columns=['fuel_type'], inplace=True)
df_cleaned.rename(columns={'fuel_type2':'fuel_type'},inplace=True)

In [14]:
df_cleaned.head(10)

,model,year,price,transmission,mileage,engine_size,mileage2,fuel_type,engine_size2,reference
0,C Class,2020.0,30495,Automatic,NaN,2,"1,200",Diesel,NaN,/ad/25017331
1,C Class,2020.0,29989,Automatic,NaN,1.5,"1,000",Petrol,NaN,/ad/25043746
2,C Class,2020.0,37899,Automatic,NaN,2,500,Diesel,NaN,/ad/25142894
3,C Class,2019.0,30399,Automatic,NaN,2,"5,000",Diesel,NaN,/ad/24942816
4,C Class,2019.0,29899,Automatic,NaN,2,"4,500",Diesel,NaN,/ad/24913660
5,C Class,2020.0,30999,Automatic,NaN,2,"1,000",Diesel,NaN,/ad/25059312
6,C Class,2020.0,35999,Automatic,NaN,2,500,Diesel,NaN,/ad/25418851
7,C Class,2019.0,37990,Automatic,NaN,3,"1,412",Petrol,NaN,/ad/25449314
8,C Class,2019.0,28990,Automatic,NaN,2,"3,569",Diesel,NaN,/ad/25046820
9,C Class,2019.0,28990,Automatic,NaN,2,"3,635",Diesel,NaN,/ad/25046821

## Merging values
- merging values of mileage2 into milage and then removing the column milage2
- after this function we changes the mileage2 name to mileage.
- we also need to remove the comma seprator from the value so we used str.replace to replace comma with an empty character.

In [15]:
df_cleaned['mileage'] = df_cleaned['mileage2'].fillna(df_cleaned['mileage2'])

In [16]:
df_cleaned['mileage'] = pd.to_numeric(df_cleaned['mileage'].str.replace(',', ''), errors='coerce')
df_cleaned.head()

,model,year,price,transmission,mileage,engine_size,mileage2,fuel_type,engine_size2,reference
0,C Class,2020.0,30495,Automatic,1200.0,2,"1,200",Diesel,NaN,/ad/25017331
1,C Class,2020.0,29989,Automatic,1000.0,1.5,"1,000",Petrol,NaN,/ad/25043746
2,C Class,2020.0,37899,Automatic,500.0,2,500,Diesel,NaN,/ad/25142894
3,C Class,2019.0,30399,Automatic,5000.0,2,"5,000",Diesel,NaN,/ad/24942816
4,C Class,2019.0,29899,Automatic,4500.0,2,"4,500",Diesel,NaN,/ad/24913660

## Here we drop the mileage2 column

In [17]:
df_cleaned.drop(columns=['mileage2'], inplace=True)

In [18]:
df_cleaned.head(20)

,model,year,price,transmission,mileage,engine_size,fuel_type,engine_size2,reference
0,C Class,2020.0,30495,Automatic,1200.0,2,Diesel,NaN,/ad/25017331
1,C Class,2020.0,29989,Automatic,1000.0,1.5,Petrol,NaN,/ad/25043746
2,C Class,2020.0,37899,Automatic,500.0,2,Diesel,NaN,/ad/25142894
3,C Class,2019.0,30399,Automatic,5000.0,2,Diesel,NaN,/ad/24942816
4,C Class,2019.0,29899,Automatic,4500.0,2,Diesel,NaN,/ad/24913660
5,C Class,2020.0,30999,Automatic,1000.0,2,Diesel,NaN,/ad/25059312
6,C Class,2020.0,35999,Automatic,500.0,2,Diesel,NaN,/ad/25418851
7,C Class,2019.0,37990,Automatic,1412.0,3,Petrol,NaN,/ad/25449314
8,C Class,2019.0,28990,Automatic,3569.0,2,Diesel,NaN,/ad/25046820
9,C Class,2019.0,28990,Automatic,3635.0,2,Diesel,NaN,/ad/25046821
10,C Class,2013.0,9995,Automatic,46.3,£160,Petrol,1.6,/ad/25128085
11,C Class,2012.0,6995,Automatic,58.9,£125,Diesel,2.1,/ad/23763610
12,C Class,2012.0,7495,Automatic,54.3,£145,Diesel,2.1,/ad/24626603
13,C Class,2011.0,8995,Automatic,53.3,£150,Diesel,2.1,/ad/25462537
14,C Class,2015.0,14995,Automatic,62.8,£30,Diesel,2.1,/ad/25479169
15,C Class,2013.0,8595,Automatic,64.2,£30,Diesel,2143,/ad/25450549
16,C Class,2016.0,19250,Semi-Auto,60.1,£125,Diesel,2.1,/ad/25405174
17,C Class,2017.0,23500,Semi-Auto,67.3,£145,Diesel,2.1,/ad/25344580
18,C Class,2018.0,24995,Semi-Auto,64.2,£150,Diesel,2,/ad/25481454
19,C Class,2016.0,29995,Semi-Auto,34.5,£305,Petrol,4,/ad/25479287

## Operations on engine_size column
- First we fill the empty engine_size2 values with engine_size values 
- Then we convert engine_size2 values to numeric for calculations
- We have 2 different type of engine sizes i.e., cc and litres. we need to make sure the format is same across the data so we compute all the engine_size2 values which are greater than 1000 we divide them by 1000 and then round off to make all the identical across the dataframe.
- atleast we drop the engine_size and then change engine_size2 to engine_size

In [19]:
df_cleaned['engine_size2'] = df_cleaned['engine_size2'].fillna(df_cleaned['engine_size'])

In [20]:
df_cleaned['engine_size2'] = pd.to_numeric(df_cleaned['engine_size2'],errors='coerce')

In [21]:
df_cleaned['engine_size2']  = df_cleaned['engine_size2'].apply(lambda x: round(x/1000,1) if x>1000 else round(x,1))

In [22]:
df_cleaned.drop(columns=['engine_size'], inplace=True)

In [23]:
df_cleaned.head(10)

,model,year,price,transmission,mileage,fuel_type,engine_size2,reference
0,C Class,2020.0,30495,Automatic,1200.0,Diesel,2.0,/ad/25017331
1,C Class,2020.0,29989,Automatic,1000.0,Petrol,1.5,/ad/25043746
2,C Class,2020.0,37899,Automatic,500.0,Diesel,2.0,/ad/25142894
3,C Class,2019.0,30399,Automatic,5000.0,Diesel,2.0,/ad/24942816
4,C Class,2019.0,29899,Automatic,4500.0,Diesel,2.0,/ad/24913660
5,C Class,2020.0,30999,Automatic,1000.0,Diesel,2.0,/ad/25059312
6,C Class,2020.0,35999,Automatic,500.0,Diesel,2.0,/ad/25418851
7,C Class,2019.0,37990,Automatic,1412.0,Petrol,3.0,/ad/25449314
8,C Class,2019.0,28990,Automatic,3569.0,Diesel,2.0,/ad/25046820
9,C Class,2019.0,28990,Automatic,3635.0,Diesel,2.0,/ad/25046821

In [24]:
df_cleaned.dropna(inplace=True)
df_cleaned.head(10)

,model,year,price,transmission,mileage,fuel_type,engine_size2,reference
0,C Class,2020.0,30495,Automatic,1200.0,Diesel,2.0,/ad/25017331
1,C Class,2020.0,29989,Automatic,1000.0,Petrol,1.5,/ad/25043746
2,C Class,2020.0,37899,Automatic,500.0,Diesel,2.0,/ad/25142894
3,C Class,2019.0,30399,Automatic,5000.0,Diesel,2.0,/ad/24942816
4,C Class,2019.0,29899,Automatic,4500.0,Diesel,2.0,/ad/24913660
5,C Class,2020.0,30999,Automatic,1000.0,Diesel,2.0,/ad/25059312
6,C Class,2020.0,35999,Automatic,500.0,Diesel,2.0,/ad/25418851
7,C Class,2019.0,37990,Automatic,1412.0,Petrol,3.0,/ad/25449314
8,C Class,2019.0,28990,Automatic,3569.0,Diesel,2.0,/ad/25046820
9,C Class,2019.0,28990,Automatic,3635.0,Diesel,2.0,/ad/25046821

## Year value is given in float so we changes it to integer type

In [25]:
df_cleaned['year'].astype('int64')

0       2020
1       2020
2       2020
3       2019
4       2019
        ...
3902    2017
3903    2018
3904    2014
3905    2014
3906    2014
Name: year, Length: 3884, dtype: int64

## Dropping the model and reference columns as given.

In [26]:

df_cleaned.drop(columns=['model','reference'],inplace=True)
df_cleaned.head()

     year    price transmission  mileage fuel_type  engine_size2
0  2020.0    30495    Automatic   1200.0    Diesel           2.0
1  2020.0    29989    Automatic   1000.0    Petrol           1.5
2  2020.0    37899    Automatic    500.0    Diesel           2.0
3  2019.0    30399    Automatic   5000.0    Diesel           2.0
4  2019.0    29899    Automatic   4500.0    Diesel           2.0

## Replacing categorical data

- In Transmission we have categorical data which is not useful for calculations so we used pd.get_dummies function to get all the different categories for transmission and then converting it to integer type to get values 1 and 0
- 1 represents that the current item has specific type of transmision present.
- we create a dummy datafram to get all the categories and their value and then join the dummy dataframe into our main dataframe.
- after this we remove the tranmission column which only contains the categorical values.
- Later we do the same process with fuel_type column and repeat all the steps.

In [27]:
df_transmit = pd.get_dummies(df_cleaned['transmission'])
df_transmit.rename(columns={'Other':'Other_Transmission'},inplace=True)
df_transmit.head()

   Automatic  Manual  Other_Transmission  Semi-Auto
0          1       0                   0          0
1          1       0                   0          0
2          1       0                   0          0
3          1       0                   0          0
4          1       0                   0          0

In [28]:
df_transmit['Automatic'] = df_transmit['Automatic'].astype(int)
df_transmit['Manual'] = df_transmit['Manual'].astype(int)
df_transmit['Other_Transmission'] = df_transmit['Other_Transmission'].astype(int)
df_transmit['Semi-Auto'] = df_transmit['Semi-Auto'].astype(int)

In [29]:
df_cleaned = df_cleaned.join(df_transmit)
df_cleaned.drop(columns='transmission',inplace=True)

In [30]:
df_cleaned.head()

,year,price,mileage,fuel_type,engine_size2,Automatic,Manual,Other_Transmission,Semi-Auto
0,2020.0,30495,1200.0,Diesel,2.0,1,0,0,0
1,2020.0,29989,1000.0,Petrol,1.5,1,0,0,0
2,2020.0,37899,500.0,Diesel,2.0,1,0,0,0
3,2019.0,30399,5000.0,Diesel,2.0,1,0,0,0
4,2019.0,29899,4500.0,Diesel,2.0,1,0,0,0

In [31]:
df_fuel = pd.get_dummies(df_cleaned['fuel_type'],dtype=int)
df_fuel.rename(columns={'Other':'Other_Fuel'},inplace=True)
df_fuel.head()

   Diesel  Hybrid  Other_Fuel  Petrol
0       1       0           0       0
1       0       0           0       1
2       1       0           0       0
3       1       0           0       0
4       1       0           0       0

In [32]:
df_cleaned = df_cleaned.join(df_fuel)

In [33]:
df_cleaned.drop(columns=['fuel_type'],inplace=True)
df_cleaned.head()

,year,price,mileage,engine_size2,Automatic,Manual,Other_Transmission,Semi-Auto,Diesel,Hybrid,Other_Fuel,Petrol
0,2020.0,30495,1200.0,2.0,1,0,0,0,1,0,0,0
1,2020.0,29989,1000.0,1.5,1,0,0,0,0,0,0,1
2,2020.0,37899,500.0,2.0,1,0,0,0,1,0,0,0
3,2019.0,30399,5000.0,2.0,1,0,0,0,1,0,0,0
4,2019.0,29899,4500.0,2.0,1,0,0,0,1,0,0,0

In [34]:
df_cleaned.rename(columns={'engine_size2':'engine_size'},inplace=True)
df_cleaned['year'] = df_cleaned['year'].astype('int64')
df_cleaned['price'] = pd.to_numeric(df_cleaned['price'])

## This is the final shape of the data after cleaning which is exactly the same as given in result csv file

In [35]:
print(df_cleaned.head())
print("This dataset has {} data points with {} variables.".format(*df_cleaned.shape))

   year  price  mileage  engine_size  Automatic  Manual  Other_Transmission  \
0  2020  30495   1200.0          2.0          1       0                   0
1  2020  29989   1000.0          1.5          1       0                   0
2  2020  37899    500.0          2.0          1       0                   0
3  2019  30399   5000.0          2.0          1       0                   0
4  2019  29899   4500.0          2.0          1       0                   0

   Semi-Auto  Diesel  Hybrid  Other_Fuel  Petrol
0          0       1       0           0       0
1          0       0       0           0       1
2          0       1       0           0       0
3          0       1       0           0       0
4          0       1       0           0       0
This dataset has 3884 data points with 12 variables.

## Saving the cleaned data into csv

In [36]:
df_cleaned.to_csv('cleaned_data.csv')

## Data transformation
- Remove duplicates - does not need to pass a specific column as we want to remove rows that has same value for all columns

In [37]:
#Identify duplicate rows
duplicates = df_cleaned[df_cleaned.duplicated(keep='first')] #same as keep=False
print(duplicates)

#Remove duplicates from cleaned data frame
#df_cleaned.duplicated()
df_cleaned = df_cleaned.drop_duplicates()
print(df_cleaned)

# 3884 (previous) - 509 (duplicates) = 3375 records left 
print("This dataset has {} data points with {} variables.".format(*df_cleaned.shape))

      year  price  mileage  engine_size  Automatic  Manual  \
73    2016  14000  45000.0          2.1          1       0
74    2015  12000  40005.0          2.1          1       0
84    2016  14000  45000.0          2.1          1       0
85    2015  12000  40005.0          2.1          1       0
86    2017  22767  30676.0          2.1          1       0
...    ...    ...      ...          ...        ...     ...
3886  2019  25995     60.1          1.6          1       0
3887  2016  14000  45000.0          2.1          1       0
3888  2015  12000  40005.0          2.1          1       0
3889  2017  22767  30676.0          2.1          1       0
3895  2019  27999     46.3          1.5          1       0

      Other_Transmission  Semi-Auto  Diesel  Hybrid  Other_Fuel  Petrol
73                     0          0       1       0           0       0
74                     0          0       1       0           0       0
84                     0          0       1       0           0       0
85                     0          0       1       0           0       0
86                     0          0       1       0           0       0
...                  ...        ...     ...     ...         ...     ...
3886                   0          0       1       0           0       0
3887                   0          0       1       0           0       0
3888                   0          0       1       0           0       0
3889                   0          0       1       0           0       0
3895                   0          0       0       0           0       1

[509 rows x 12 columns]
      year  price  mileage  engine_size  Automatic  Manual  \
0     2020  30495   1200.0          2.0          1       0
1     2020  29989   1000.0          1.5          1       0
2     2020  37899    500.0          2.0          1       0
3     2019  30399   5000.0          2.0          1       0
4     2019  29899   4500.0          2.0          1       0
...    ...    ...      ...          ...        ...     ...
3902  2017  14700     70.6          1.6          0       1
3903  2018  18500     64.2          2.1          1       0
3904  2014  11900     65.7          2.1          0       1
3905  2014  11300     56.5          2.1          1       0
3906  2014  14800     64.2          2.1          1       0

      Other_Transmission  Semi-Auto  Diesel  Hybrid  Other_Fuel  Petrol
0                      0          0       1       0           0       0
1                      0          0       0       0           0       1
2                      0          0       1       0           0       0
3                      0          0       1       0           0       0
4                      0          0       1       0           0       0
...                  ...        ...     ...     ...         ...     ...
3902                   0          0       1       0           0       0
3903                   0          0       1       0           0       0
3904                   0          0       1       0           0       0
3905                   0          0       1       0           0       0
3906                   0          0       1       0           0       0

[3375 rows x 12 columns]
This dataset has 3375 data points with 12 variables.

In [38]:
df_cleaned.describe()

,year,price,mileage,engine_size,Automatic,Manual,Other_Transmission,Semi-Auto,Diesel,Hybrid,Other_Fuel,Petrol
count,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000,3375.000000
mean,2017.271111,23690.991407,527.040326,2.057659,0.442963,0.056000,0.000296,0.500741,0.606222,0.041778,0.001778,0.350222
std,2.085099,9207.376758,4836.133032,0.501704,0.496810,0.229956,0.017213,0.500074,0.488659,0.200111,0.042132,0.477110
min,2002.000000,1495.000000,23.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2016.000000,17400.000000,46.300000,2.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,2018.000000,22899.000000,58.900000,2.000000,0.000000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000,0.000000
75%,2019.000000,28888.500000,64.200000,2.100000,1.000000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000,1.000000
max,2020.000000,88995.000000,113770.000000,6.200000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

- Remove outliers: To detect outlier, we set the lower limit to three standard deviations below the mean (μ - 3*σ), and the upper limit to three standard deviations above the mean (μ + 3*σ).

In [39]:
# find out the indexes of outliers
mean = np.mean(df_cleaned["price"])
#print(mean)
std = np.std(df_cleaned["price"])
#print(sdev)

lower_limit = df_cleaned.loc[df_cleaned["price"] < (mean - 3*std) ].index
upper_limit = df_cleaned.loc[df_cleaned["price"] > (mean + 3*std) ].index
print("lower limit: ", lower_limit)
print("upper limit: ", upper_limit)
print("number of records: ", len(lower_limit) + len(upper_limit))

# drop them
df_cleaned.drop(lower_limit, inplace=True)
df_cleaned.drop(upper_limit, inplace=True)

# 3375(previous) - 44 (outliers) = 3331 records left
print("This dataset has {} data points with {} variables.".format(*df_cleaned.shape))

lower limit:  Int64Index([], dtype='int64')
upper limit:  Int64Index([  80,   82,  186,  326,  565,  568,  680,  712,  745,  817,  819,
             898, 1029, 1359, 1595, 1624, 1625, 1667, 1680, 1683, 1684, 1718,
            1754, 1833, 1915, 2039, 2156, 2174, 2182, 2232, 2387, 2395, 2457,
            2508, 2535, 2538, 2567, 2665, 2766, 3207, 3208, 3210, 3520, 3864],
           dtype='int64')
number of records:  44
This dataset has 3331 data points with 12 variables.